Masmiseim36/nxpSDK/devices/MIMXRT685S/cmsis_drivers/fsl_usart_cmsis.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart10_dma_driver_state")
static cmsis_usart_dma_driver_state_t usart10_DmaDriverState = {
#else
static cmsis_usart_dma_driver_state_t usart10_DmaDriverState = {
#endif
    &usart10_Resource, &usart10_DmaResource, &USART10_DmaHandle, &USART10_DmaRxHandle, &USART10_DmaTxHandle,
};

static int32_t USART10_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART10_PIN_INIT
    RTE_USART10_PIN_INIT();
#endif
    return USART_DmaInitialize(cb_event, &usart10_DmaDriverState);
}

static int32_t USART10_DmaUninitialize(void)
{
#ifdef RTE_USART10_PIN_DEINIT
    RTE_USART10_PIN_DEINIT();
#endif
    return USART_DmaUninitialize(&usart10_DmaDriverState);
}

static int32_t USART10_DmaPowerControl(ARM_POWER_STATE state)
{
    return USART_DmaPowerControl(state, &usart10_DmaDriverState);
}

static int32_t USART10_DmaSend(const void *data, uint32_t num)
{
    return USART_DmaSend(data, num, &usart10_DmaDriverState);
}

static int32_t USART10_DmaReceive(void *data, uint32_t num)
{
    return USART_DmaReceive(data, num, &usart10_DmaDriverState);
}

static int32_t USART10_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_DmaTransfer(data_out, data_in, num, &usart10_DmaDriverState);
}

static uint32_t USART10_DmaGetTxCount(void)
{
    return USART_DmaGetTxCount(&usart10_DmaDriverState);
}

static uint32_t USART10_DmaGetRxCount(void)
{
    return USART_DmaGetRxCount(&usart10_DmaDriverState);
}

static int32_t USART10_DmaControl(uint32_t control, uint32_t arg)
{
    return USART_DmaControl(control, arg, &usart10_DmaDriverState);
}

static ARM_USART_STATUS USART10_DmaGetStatus(void)
{
    return USART_DmaGetStatus(&usart10_DmaDriverState);
}

#endif

#else

static usart_handle_t USART10_Handle;
#if defined(USART10_RX_BUFFER_ENABLE) && (USART10_RX_BUFFER_ENABLE == 1)
static uint8_t usart10_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("usart10_non_blocking_driver_state")
static cmsis_usart_non_blocking_driver_state_t usart10_NonBlockingDriverState = {
#else
static cmsis_usart_non_blocking_driver_state_t usart10_NonBlockingDriverState = {
#endif
    &usart10_Resource,
    &USART10_Handle,
};

static int32_t USART10_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART10_PIN_INIT
    RTE_USART10_PIN_INIT();
#endif
    return USART_NonBlockingInitialize(cb_event, &usart10_NonBlockingDriverState);
}

static int32_t USART10_NonBlockingUninitialize(void)
{
#ifdef RTE_USART10_PIN_DEINIT
    RTE_USART10_PIN_DEINIT();
#endif
    return USART_NonBlockingUninitialize(&usart10_NonBlockingDriverState);
}

static int32_t USART10_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    uint32_t result;

    result = USART_NonBlockingPowerControl(state, &usart10_NonBlockingDriverState);
#if defined(USART10_RX_BUFFER_ENABLE) && (USART10_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (usart10_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        USART_TransferStartRingBuffer(usart10_NonBlockingDriverState.resource->base,
                                      usart10_NonBlockingDriverState.handle, usart10_rxRingBuffer, USART_RX_BUFFER_LEN);
    }
#endif
    return result;
}

static int32_t USART10_NonBlockingSend(const void *data, uint32_t num)
{
    return USART_NonBlockingSend(data, num, &usart10_NonBlockingDriverState);
}

static int32_t USART10_NonBlockingReceive(void *data, uint32_t num)
{
    return USART_NonBlockingReceive(data, num, &usart10_NonBlockingDriverState);
}

static int32_t USART10_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return USART_NonBlockingTransfer(data_out, data_in, num, &usart10_NonBlockingDriverState);
}

static uint32_t USART10_NonBlockingGetTxCount(void)
{
    return USART_NonBlockingGetTxCount(&usart10_NonBlockingDriverState);
}

static uint32_t USART10_NonBlockingGetRxCount(void)
{
    return USART_NonBlockingGetRxCount(&usart10_NonBlockingDriverState);
}

static int32_t USART10_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = USART_NonBlockingControl(control, arg, &usart10_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }
#if defined(USART10_RX_BUFFER_ENABLE) && (USART10_RX_BUFFER_ENABLE == 1)
    /* Start receiving interrupts */
    usart10_NonBlockingDriverState.resource->base->FIFOINTENSET |=
        USART_FIFOINTENSET_RXLVL_MASK | USART_FIFOINTENSET_RXERR_MASK;
#endif
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS USART10_NonBlockingGetStatus(void)
{
    return USART_NonBlockingGetStatus(&usart10_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART10 = {
    USARTx_GetVersion,      USARTx_GetCapabilities,
#if RTE_USART10_DMA_EN
    USART10_DmaInitialize,  USART10_DmaUninitialize, USART10_DmaPowerControl, USART10_DmaSend,    USART10_DmaReceive,
    USART10_DmaTransfer,    USART10_DmaGetTxCount,   USART10_DmaGetRxCount,   USART10_DmaControl, USART10_DmaGetStatus,
#else
    USART10_NonBlockingInitialize,
    USART10_NonBlockingUninitialize,
    USART10_NonBlockingPowerControl,
    USART10_NonBlockingSend,
    USART10_NonBlockingReceive,
    USART10_NonBlockingTransfer,
    USART10_NonBlockingGetTxCount,
    USART10_NonBlockingGetRxCount,
    USART10_NonBlockingControl,
    USART10_NonBlockingGetStatus,
#endif
    USARTx_SetModemControl, USARTx_GetModemStatus};

#endif /* usart10 */

#if defined(USART11) && defined(RTE_USART11) && RTE_USART11

/* User needs to provide the implementation for USART11_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t USART11_GetFreq(void);

static cmsis_usart_resource_t usart11_Resource = {USART11, USART11_GetFreq};

#if defined(RTE_USART11_DMA_EN) && RTE_USART11_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_usart_dma_resource_t usart11_DmaResource = {
    RTE_USART11_DMA_TX_DMA_BASE,
    RTE_USART11_DMA_TX_CH,
    RTE_USART11_DMA_RX_DMA_BASE,
    RTE_USART11_DMA_RX_CH,
};

